"""
Задание 3. 
Написать программу, которая будет спрашивать у пользователя Имя и Фамилию,
а затем выводить на экран Сообщение: Привет Имя, твоя фамилия Фамилия.
"""
name = input('Введите Ваше имя:')
family = input('Введите Вашу фамилию:')

print('Привет', name + ',', 'твоя фамилия Фамилия', family)



