"""
Задание 2. 
Создать 2 переменные, задать им 2 числа, для первой переменной число будет 5,
для второй 20. Вывести на экран сумму этих 2 переменных
"""
i = 5
j = 20
sum = i + j
print(sum)



