"""
Задание 1. 
Написать программу, которая будет просить у пользователя ввести имя, 
а затем выводить на экран(в консоль) фразу Привет + Имя пользователя
"""
name = input('Введите Ваше имя:')

print('Привет', name + '!')



